In [ ]:
==================== Data Analysis =============================
1. Pandas         :  Data frame analysis
2. Numpy          :  Numerical analysis
3. matplotlib     :  Graphs and plots
4. seaborn        :  plots
5. Bokhe         :   plots
6. plotly         :  plots

=================== Machine Learning ============================
7. stats          : for statistical models
8. scikit-learn(sklearn) :  ML models

===================  Deep learning ============================
9. opencv         : Computer vision
10. pillow        : Image operations
11. tensorflow    : Neural Network creations (developed by google)
12. keras         : NN
13. pytorch       : alternative package of tensorflow (facebook meta)

==================== NLP ========================================
14. NLTK          : Natural language toolkit
15. SpaCy         : Alternative to NLTK
16. wordcloud     : most frequent occured words       

======================= Scarapping =================================
17. SqLite        : Data base creation
18. Beautiful soup
19. Selenium

======================== API creations ===========================
20. Flask
21. FastAPI
22. Gradio
23. Django
======================= UI app creation =========================
24.Streamlit

===================== Transfer learning models(DL) ===========
25. Mobilenet
26. Resnet
27. VGGnet
28. Inception
29. Yolo    :  Ultralytics

===================== Transfer learning models(NLP) ===========
30. Word2vec
31. GloVe

======================== Hugging Face Transformers ===============
32. BERT   : Bi Directional Encoder representation of Transformers

========================== Allen NLP =======================
33. Allen NLP packages

================== GenAI =============================
34. LangChain
35. Google GeminiAi realted pcakges
36. OpenAI GPT realted packages
37. Amazon BedRock realted packages
38. Meta Llama  related packages

==================== Image and Video Generations ==============
39. GAN models realted packages
40. SORA related packages
41. nano banana

=================== Model deployment (MlOps)===================
41. mlflow using databricks
42. kubeflow (GCP account)

==================== Cloud applications =====================
43. Azure ML realted packages
44. GCP VertexAI related packages
45. AWS Sagemaker realted packages

==================== small ===================================
46. time
47. logging
48. math
49. random
50. env
51. os

**Step-1: Import packages**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a Df using list**

In [7]:
names=['Ramesh','Suresh','Sathish']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**Step-3: I want to change the index**

In [12]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
pd.DataFrame(names,ids)
# pd.DataFrame(data,index)

         0
A   Ramesh
B   Suresh
C  Sathish

**Step-4: add the columns**

In [26]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**Step-5: Data and columns**

In [22]:
names=['Ramesh','Suresh','Sathish']
cols=['Names']
pd.DataFrame(names,columns=cols)

     Names
0   Ramesh
1   Suresh
2  Sathish

**Step-6: Multiple columns**

In [50]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
cols=['Names','Age']
df=pd.DataFrame(zip(names,age),
             columns=cols)
# pd.DataFrame(data,index)
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**Step-7: Add a new column to alreday existed df**

- in above first we have taken data

- then created a dataframe

- now we want to add new data based on requirement

In [52]:
city=['Hyd','Pune','Blr']
df['City']=city
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [58]:
df['Marks']=[20,30,40]

In [60]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   22  Pune     30
2  Sathish   24   Blr     40

**Step-8: Update the column with new values**

In [67]:
df['Marks']=[200,300,400]

In [69]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

**Step-9: create empty dataframe and add the columns**

In [74]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**Step-10: Create a df using dictionary**

In [8]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [10]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [91]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d,index=[0])

     Name  Age
0  Ramesh   20

**Step-11:Save the dataframe**

In [96]:
# file handling session
# directory//filename.ext
# filename.ext
# we are saving dataframes
#    .csv  or  .xlsx 

df.to_csv('data.csv')

In [98]:
df.to_csv(r'C:\Users\omkar\OneDrive\Documents\data.csv')

In [100]:
df.to_excel('data.xlsx')

**Step-12: Read the dataframe**

In [4]:
# in order to read the data
# filename.ext
# open(mobox-short.txt).read()
# open(dummy.txt,mode='w').write('hello')

# data.csv     data.xlsx
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [14]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [16]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [ ]:
df.to_csv
pd.read_csv

df.to_excel
pd.read_excel

In [18]:
df.to_csv('data1.csv',index=False)

In [20]:
pd.read_csv('data1.csv')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [22]:
df.to_excel('data1.xlsx',index=False)

In [24]:
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [26]:
# add one more column marks to df
df['marks']=[100,200,300]
df

     Names  Age  City  marks
0   Ramesh   20   Hyd    100
1   Suresh   22   Blr    200
2  Sathish   24  Pune    300

**Step-13: Drop the column**

- labels

- axis

- index

- columns

- inplace

In [33]:
# if i want to drop a index 
# I need to use index argument name
df.drop(index=1)

     Names  Age  City  marks
0   Ramesh   20   Hyd    100
2  Sathish   24  Pune    300

In [35]:
df

     Names  Age  City  marks
0   Ramesh   20   Hyd    100
1   Suresh   22   Blr    200
2  Sathish   24  Pune    300

In [37]:
# if i want to drop a index 
# I need to use index argument name
df.drop(columns='marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [39]:
df.drop(columns=['City','marks'])

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [41]:
df

     Names  Age  City  marks
0   Ramesh   20   Hyd    100
1   Suresh   22   Blr    200
2  Sathish   24  Pune    300

In [ ]:
df.drop(index=1)
df.drop(columns='marks')
#=============================================
df.drop('marks') # if i dont give argument lable
df.drop(1)  # 1 become label
#=========================================
# we need to provide axis
# axis= 0 indicates index
# axis=1 indicates columns

In [43]:
df.drop('marks') 
# by defulat label='marks'
# if you dont mention axis
# by defualt axis=0 ====? index

KeyError: "['marks'] not found in axis"

In [45]:
df.drop('marks',axis=0)

KeyError: "['marks'] not found in axis"

In [47]:
df.drop('marks',axis=1)

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

**inplace**

- when we do the operation the result output is not overwriting

- means the original dataframe is same as it is.

- in order to do this we need use **inplace**

- by default inplace = False

- make **inplace=True** if you want overwrite the result

In [51]:
df.drop('marks',axis=1,inplace=True)

In [53]:
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

**Step-14: Rename the column**

In [57]:
d={'City':'city'}  # {old:new}
#df.rename(<mapper>,<axis>,<inplace>)
df.rename(d,axis=1,inplace=True)

In [61]:
d={2:'B'}  # {old:new}
#df.rename(<mapper>,<axis>,<inplace>)
df.rename(d,axis=0,inplace=True)

In [63]:
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
B  Sathish   24  Pune

In [69]:
## Create one more df
# x= 1 to 10
# y= square x
# z = cube x
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),
             columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len

- shape: df.shape

- size : df.size

- head : df.head

- tail : df.tail

- isnull : df.isnull

- dtypes: df.types

- info : df.info

In [72]:
len(df)

10

In [74]:
df.shape  # 10 rows  3 cols

(10, 3)

In [76]:
df.size

30

In [78]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [80]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [82]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [84]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [88]:
df.dtypes
# if any cat colums occures
# it represent as object
# int === int64
# float

X    int64
Y    int64
Z    int64
dtype: object

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**step-15: select a columns**

In [94]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [96]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [98]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [100]:
type(df['X'])
# 1d

pandas.core.series.Series

In [102]:
type(df[['X','Y']])
# 2D

pandas.core.frame.DataFrame

In [104]:
df['X'].shape

(10,)

In [106]:
df[['X','Y']].shape

(10, 2)

In [118]:
df  # dataframe
df['Z'] # slecting one particular column
df['Z'].values # extracting the data
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [116]:
df
df[['Y','Z']]
df[['Y','Z']].values

array([[   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]], dtype=int64)